--#########################-------------------------------------------
--      Плагин: oil      ##     Файловый менеджер (буфферный)       --
--#########################-------------------------------------------
require("oil").setup({
  -- 1. Общие настройки --
  default_file_explorer         = true,           -- Файловый менеджер по умолчанию
  skip_confirm_for_simple_edits = true,           -- Не показывать подтверждения для простых операций
  delete_to_trash               = false,          -- Удаление в корзину (false - перманентно)
  use_default_keymaps           = false,          -- Использовать стандартные биндинги
  columns                       = { "icon" },     -- Что показывать слева от директории/файла
  -- 2. Настройки буфера oil -- 
  win_options = {
    wrap = false,                                 -- Перенос строк 
    signcolumn = "yes:2",                         -- Нужно для плагина oil-git-status
  },
  -- 3. Как отображаются файлы и директории --
  view_options = {
    show_hidden                 = true,           -- Показывать скрытые файлы
    -- 3.1 Какие файлы всегда скрывать --
    is_always_hidden = function(name, bufnr)
      return name == ".."                         -- Список "что не показывать"
    end,
  },
  -- 4 Настройки плавающего окна --
  float = {
    preview_split = "right",                      -- Где показывать окно предпросмотра в сплите
    border        = "rounded",                    -- Стиль рамки
    max_width     = 0.8,                          -- Размер максимум 80% от ширины экрана
    max_height    = 0.8,                          -- Размер максимум 80% от высоты экрана
  },
  -- 5. Автоматическое обновление git-индекса при изменении файлов в Oil --
  git = {
    add = function() return true end,             -- включить автоматический `git add` при создании/добавлении файлов
    mv  = function() return true end,             -- включить автоматический `git mv` при перемещении/переименовании файлов
    rm  = function() return true end,             -- включить автоматический `git rm` при удалении файлов
  },
  -- 6. Биндинги в буфере oil --
  keymaps = {
    ["<Esc>"] = "actions.close",                  -- (ESC) Закрыть буфер Oil
    ["<CR>"]  = "actions.select",                 -- (Enter) Открыть файл/зайти в директорию
    ["gx"]    = "actions.open_external",          -- Открывать файлы в ассоциирующихся программах 
    ["."]     = "actions.toggle_hidden",          -- (.) Показать/скрыть скрытые файлы
  },
})
-- 7. Биндинги глобальные Neovim--
-- 7.1 Открытие oil в текущей директории на "-" --
vim.keymap.set("n", "-", function()                             -- Нормальный режим, клавиша "-"
  return vim.bo.filetype == "oil"                               -- Если текущий буфер oil
    and vim.cmd("Oil")                                          -- Выполнить команду :Oil (подняться на уровень выше) 
    or require("oil").open_float(vim.fn.expand("%:p:h"))        -- Иначе открыть oil в текущей директории в флоат окне 
end)

-- 8. Настройка плагина oil-git-status --
local symbols = { -- Переменная. Символы, отображаемые в signcolumn
  ["!"] = "󰈉",    -- Игнорируемый файл (.gitignore)
  ["?"] = "?",    -- Не добавлен в индекс
  ["A"] = "",    -- Новый файл добавлен в индекс 
  ["C"] = "",    -- Скопирован и добавлен в индекс 📄
  ["D"] = "",    -- Удалён и это добавлено в индекс  
  ["M"] = "󰙏",    -- Изменен существующий в индексе файл 
  ["R"] = "",    -- Переименован файл и это добавлено в индекс
  ["T"] = "",    -- Изменён тип файла и это добавлено в индекс
  ["U"] = "",    -- Конфликт при слиянии (unmerged / unresolved) ⚔️
  [" "] = " ",    -- Без изменений, файл в индексе соответствует последнему коммиту
}
require('oil-git-status').setup({
  show_ignored = true,        -- Игнорируемые как !!
  symbols = {
    index        = symbols,   -- Левая колонка: показывает статус файла в индексе относительно последнего коммита
    working_tree = symbols,   -- Правая колонка: показывает статус файлов локальных (на диске) относительно индекса 
  },
})
-- TODO для корректного отображения надо сделать, чтобы обновлялся refresh при изменениях в файловой системе (иначе не меняются значения) 
-- 9. Настройка хайлайтсов --
local hl = vim.api.nvim_set_hl                                      -- Переменная
-- 9.1 oil хайлайтсы --
hl(0, "OilHidden",           { fg = "#3F4257", italic = false })    -- Общее для скрытых
hl(0, "OilFile",             { fg = "#C0CAF5" })                    -- Обычные файлы
hl(0, "OilDir",              { fg = "#F5D76E" })                    -- Имена директорий
hl(0, "OilDirIcon",          { fg = "#F5D76E" })                    -- Иконки директорий
hl(0, "OilDirHidden",        { fg = "#8F8552" })                    -- Имена скрытых директорий
hl(0, "OilLink",             { fg = "#7EC699" })                    -- Имена обычных символических ссылок
hl(0, "OilLinkHidden",       { fg = "#4B7355" })                    -- Имена скрытых символических ссылок
hl(0, "OilOrphanLink",       { fg = "#FF6C6B" })                    -- Имена обычных сиротских ссылок
hl(0, "OilOrphanLinkHidden", { fg = "#8B2F2F" })                    -- Имена скрытых сиротских ссылок
-- 9.2 oil-git-status хайлайтсы --
--hl(0, "OilGitStatusIndexUnmodified",        { fg = "#C0CAF5" })   -- Без изменений (индекс) TODO как отдельную полосу сделать цветом
--hl(0, "OilGitStatusWorkingTreeUnmodified",  { fg = "#C0CAF5" })   -- Без изменений (рабочая директория)
hl(0, "OilGitStatusIndexIgnored",           { fg = "#3F4257" })     -- Игнорируемый файл (индекс)
hl(0, "OilGitStatusWorkingTreeIgnored",     { fg = "#3F4257" })     -- Игнорируемый файл (рабочая директория)
hl(0, "OilGitStatusIndexUntracked",         { fg = "#FF5555" })     -- Новый / неотслеживаемый (индекс)
hl(0, "OilGitStatusWorkingTreeUntracked",   { fg = "#FF5555" })     -- Новый / неотслеживаемый (рабочая директория)
hl(0, "OilGitStatusIndexAdded",             { fg = "#50FA7B" })     -- Добавлен в индекс
hl(0, "OilGitStatusWorkingTreeAdded",       { fg = "#50FA7B" })     -- Добавлен в рабочей директории
hl(0, "OilGitStatusIndexCopied",            { fg = "#8BE9FD" })     -- Скопирован и добавлен в индекс
hl(0, "OilGitStatusWorkingTreeCopied",      { fg = "#8BE9FD" })     -- Скопирован в рабочей директории
hl(0, "OilGitStatusIndexDeleted",           { fg = "#FF5555" })     -- Удалён и добавлен в индекс
hl(0, "OilGitStatusWorkingTreeDeleted",     { fg = "#FF5555" })     -- Удалён в рабочей директории
hl(0, "OilGitStatusIndexModified",          { fg = "#FFB86C" })     -- Изменён и добавлен в индекс
hl(0, "OilGitStatusWorkingTreeModified",    { fg = "#FFB86C" })     -- Изменён в рабочей директории
hl(0, "OilGitStatusIndexRenamed",           { fg = "#8BE9FD" })     -- Переименован и добавлен в индекс
hl(0, "OilGitStatusWorkingTreeRenamed",     { fg = "#8BE9FD" })     -- Переименован в рабочей директории
hl(0, "OilGitStatusIndexTypeChanged",       { fg = "#FF79C6" })     -- Изменён тип файла и добавлен в индекс
hl(0, "OilGitStatusWorkingTreeTypeChanged", { fg = "#FF79C6" })     -- Изменён тип файла в рабочей директории
hl(0, "OilGitStatusIndexUnmerged",          { fg = "#FF5555", bg = "#3E3E42", bold = true })  -- Конфликт (индекс)
hl(0, "OilGitStatusWorkingTreeUnmerged",    { fg = "#FF5555", bg = "#3E3E42", bold = true })  -- Конфликт (рабочая директория)

